[Demo_Destiny_ep5_2_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=4522,Y=-4619,Z=95),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=4332,Y=-4619,Z=-40),VecSub=(X=0,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Fountain.GG2_AMB_Fountain_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[13]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=0,Number=3,Bit=1)
DemoScripts[14]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[15]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_2.GG2_V_DES_ep5_2_003_Cue',Name="エコロ")
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[17]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[18]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1201_fx_Angry2Stand",Rate=0,Number=2,Bit=0)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[20]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_2.GG2_V_DES_ep5_2_004_Cue',Name="エコロ")
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[22]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[24]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0200_lp_half_normal",Rate=0,Number=0,Bit=1)
DemoScripts[25]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=0,Number=1,Bit=0)
DemoScripts[26]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_2.GG2_V_DES_ep5_2_006_Cue',Name="エコロ")
DemoScripts[27]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[28]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[30]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0105_fx_Stand2Seamon",Rate=0,Number=3,Bit=1)
DemoScripts[31]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0500_lp_Sermon",Number=8)
DemoScripts[32]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_2.GG2_V_DES_ep5_2_008_Cue',Name="エコロ")
DemoScripts[33]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[34]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[36]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0002_fx_close_smile_S",Rate=0,Number=1,Bit=0)
DemoScripts[37]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0501_fx_Seamon2Stand",Rate=0,Number=2,Bit=0)
DemoScripts[38]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[39]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_2.GG2_V_DES_ep5_2_010_Cue',Name="エコロ")
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[41]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[42]=(Actor=WINDOW,Command=EXIT)
DemoScripts[43]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[44]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[45]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[46]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[47]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep5_2_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep5_2_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="這次也......沒找到....../n真的......有嗎....../n命運的對象......")

Texts[1]=(Label="TEXT02",Name="峯大",Text="要是今天內沒找到的話....../n我就一輩子沒女朋友了......唉.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="這次換峯大大人嘆氣了啊./n請打起精神來!")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="就算是為了我的前途/n也要找到命運的戀人!/n你不是剛剛才宣誓過嗎?")

Texts[4]=(Label="TEXT05",Name="峯大",Text="那麼,要是到了無計可施的時候/n艾可蘿願意和我交往嗎?")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="這就容我拒絕了.")

Texts[6]=(Label="TEXT07",Name="峯大",Text="咦--?")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="不是\"咦--\"吧!/n我可是天使! 而你是人類!/nDo you understand?")

Texts[8]=(Label="TEXT09",Name="峯大",Text="Y......Yes.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="別洩氣了,繼續尋找吧!/n戀愛之路是靠雙腳走出來的!")

Texts[10]=(Label="",Name="",Text="")

Texts[11]=(Label="SELECT01",Name="",Text="")

Texts[12]=(Label="SELECT02",Name="",Text="")

Texts[13]=(Label="SELECT03",Name="",Text="")

Texts[14]=(Label="SELECT04",Name="",Text="")

Texts[15]=(Label="SELECT05",Name="",Text="")

Texts[16]=(Label="SELECT06",Name="",Text="")

Texts[17]=(Label="SELECT07",Name="",Text="")

Texts[18]=(Label="SELECT08",Name="",Text="")

Texts[19]=(Label="SELECT09",Name="",Text="")

Texts[20]=(Label="SELECT10",Name="",Text="")


